app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @artcles = Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["title", "Angular"], ["body", "front-end scripting language"], ["updated_at", "2022-02-10 04:13:38.029104"], ["status", "public"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
---
  def destroy
    @article = Article.find(params[:id])
    if @article.destroy